app/controllers/events_controller.rb

INSERT INTO "events" ("title", "description", "start_date", "end_date", "created_at", "updated_at", "user_id", "occurrence") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Current.user.events.build(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "start_date" = ?, "end_date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start_date", "2022-06-30 14:01:00"], ["end_date", "2022-06-22 14:03:00"], ["updated_at", "2022-07-06 14:44:53.998328"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_event
      @event = Current.user.events.find(params[:id])