app/controllers/motivations_controller.rb

  def index
    @motivations = Current.user.motivations.all
---
SELECT "motivations".* FROM "motivations" WHERE "motivations"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @motivation = Current.user.motivations.build(motivation_params)

    respond_to do |format|
      if @motivation.save
---
INSERT INTO "motivations" ("goal", "reward", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["goal", "Study for two hours"], ["reward", "An icecream"], ["created_at", "2022-06-27 00:19:01.686240"], ["updated_at", "2022-06-27 00:19:01.686240"], ["user_id", 3]]

  def update
    respond_to do |format|
      if @motivation.update(motivation_params)
---
UPDATE "motivations" SET "user_id" = ?, "updated_at" = ? WHERE "motivations"."id" = ?  [["user_id", 2], ["updated_at", "2022-06-26 13:26:56.407376"], ["id", 1]]

  def destroy
    @motivation.destroy
---
DELETE FROM "motivations" WHERE "motivations"."id" = ?  [["id", 1]]

    def set_motivation
      @motivation = Current.user.motivations.find(params[:id])
---
SELECT "motivations".* FROM "motivations" WHERE "motivations"."user_id" = ? AND "motivations"."id" = ? LIMIT ?  [["user_id", 3], ["id", 2], ["LIMIT", 1]]