app/controllers/timerecords_controller.rb

    def create
        @timerecord = Current.user.timerecords.build(timerecord_params)
        if @timerecord.save
---
INSERT INTO "timerecords" ("timetype", "period", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["timetype", "study"], ["period", 40], ["user_id", 1], ["created_at", "2022-07-11 02:42:38.651714"], ["updated_at", "2022-07-11 02:42:38.651714"]]