app/controllers/todo_lists_controller.rb

INSERT INTO "todo_lists" ("content", "event_id", "created_at", "updated_at", "completed_at") VALUES (?, ?, ?, ?, ?)  [["content", "todo"], ["event_id", 1], ["created_at", "2022-06-26 03:47:59.578898"], ["updated_at", "2022-06-26 03:47:59.578898"], ["completed_at", nil]]
---
    def create
        @todo_list = @event.todo_lists.create(todo_list_params)

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."event_id" = ? AND "todo_lists"."id" = ? LIMIT ?  [["event_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 3]]
---
    def destroy
        @todo_list = @event.todo_lists.find(params[:id])
        if @todo_list.destroy

UPDATE "todo_lists" SET "updated_at" = ?, "completed_at" = ? WHERE "todo_lists"."id" = ?  [["updated_at", "2022-06-27 03:34:08.835418"], ["completed_at", "2022-06-27 03:34:08.834969"], ["id", 7]]
---
    def update
        @todo_list.update_attribute(:completed_at, Time.now)

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."event_id" = ? AND "todo_lists"."id" = ? LIMIT ?  [["event_id", 1], ["id", 3], ["LIMIT", 1]]
---
    def set_todo_list
        @todo_list = @event.todo_lists.find(params[:id])